# Deals Part 2: The Power of SQL `SELECT`s

*This notebook uses SQL select statements to learn about mergers and acquisitions in the 1990s. No, actually it's just all about SELECT statements.*

## Library Imports & Database Connection
Some version of the following will need to appear near the top of every notebook in this course. It imports the necessary software libraries and connects to a database

In [1]:
# All query results are returned as Pandas DataFrames 
import pandas as pd

# Needed for %sql Magic
%load_ext sql

# use %sql magic to connect to the deals database
%sql mysql+pymysql://dealsuser:deals@localhost/deals

'Connected: dealsuser@deals'

Let's review, line by line: 
- The code above is actually Python, which is what Jupyter prefers to use natively. 
- The lines that start with `#` are comments with English text explaining what the line below is about. 
- The `import` line allows us to use the pandas library that is all the rage at data science parties. pandas -- note that the p is is never capitalized -- provides data structures that emulate database tables. We won't make use of it here but it may be useful in later assignments.
- The `%load_ext` statement extends Jupyter to allow SQL statements instead of Python. Any statement that starts with %sql or %%sql is run as SQL instead of Python. For details of how this works, RTFM at the [ipython-sql](https://github.com/catherinedevlin/ipython-sql) repo on GitHub. 
- The last line uses `%sql` to connect to an online MySQL database. The pseudo-URL at the end (complete with `://` in the middle) tells Jupyter 
    i) how to connect (i.e., using the pymysql bridge), 
    ii) what kind of database server is on the other end of the connection (i.e., mysql), 
    iii) who is connecting (i.e., login with user `dealsuser` and password `deals`), and 
    iv) where to connect to (i.e., a databse called `deals` hosted on the local [same] computer as Jupyter).

## A Brief Warmup
To make sure that everything is working correctly, let's try a basic `SELECT` query. Copy the following into the code cell below. 

```SQL
%%sql
/* Indicate that we are using the deals database */
USE deals;  
/* Execute a test query  */
SELECT *
FROM Companies
WHERE CompanyName like "%Inc."
```
A few notes: 
- `%%sql` magic allows us to split SQL statements onto multiple lines.
- `US`E indicates what database to use, which is useful when there are multiple database connections (e.g., when copying data from one database to another).
- SQL comments use `/*  */` format.
- The `SELECT` statement is broken out into multiple clauses, each with a different purpose. The last clause (`WHERE CompanyName like "%Inc."`) restricts the listing to only companies with "Inc." at the end of their names.
- The table names are case sensitive! If we were to use `COMPANIES` instead of `Companies` then the query breaks. Try it yourself! (Why the nonstandard name? When this database was first created in 1998, it was distributed as an MS Access database, which always followed CamelCase for table names.)

In [144]:
%%sql
/* Indicate that we are using the deals database */
USE deals;  
/* Execute a test query  */
SELECT *
FROM Companies
WHERE CompanyName like "%Inc."
LIMIT 5;

 * mysql+pymysql://dealsuser:***@localhost/deals
0 rows affected.
5 rows affected.

[(2, 'Abitibi-Price Inc.'),
 (5, 'AirTouch Communications, Inc.'),
 (6, 'Alex. Brown Inc.'),
 (7, 'Allegheny Power System Inc.'),
 (318, 'American Bankers Insurance Group Inc.')]

## Your First Bug
Run the code below, which has two SQL statements in a row. It has a bug, as indicated by a cryptic error message: 
> (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'SELECT *\nFROM Companies\nORDER BY CompanyID' at line 7")

What does `Error Code: 1064` mean? It's a syntax error. Can you spot the bug in the code? In this case it's pretty subtle: we are missing a semi-colon (`;`) at the end of each SELECT statement. Add the missing semi-colons and rerun. It should work now (though only the results of the second query will be shown; it's a Jupyter thing).

In [4]:
%%sql
/* Select companies whose names end with Inc. */
SELECT *
FROM Companies
WHERE CompanyName like "%Inc.";

/* Select companies sorted by CompanyName */
SELECT *
FROM Companies
ORDER BY CompanyID
LIMIT 10;

 * mysql+pymysql://dealsuser:***@localhost/deals
111 rows affected.
10 rows affected.

[(1, '3Com Corporation'),
 (2, 'Abitibi-Price Inc.'),
 (3, 'ADT Limited'),
 (4, 'Advanta Corp. Credit card unit'),
 (5, 'AirTouch Communications, Inc.'),
 (6, 'Alex. Brown Inc.'),
 (7, 'Allegheny Power System Inc.'),
 (8, 'Allied Irish Banks P.L.C.'),
 (9, 'American Electric Power Co. Inc. and Public Service'),
 (10, 'American General Corp.')]

## Your First Join
Now let's add another query, this time with data from two tables: `Deals` and `DealParts`.

In [5]:
%%sql
SELECT DealName,PartNumber,DollarValue 
FROM Deals, DealParts
WHERE Deals.DealID = DealParts.DealID
LIMIT 10;

 * mysql+pymysql://dealsuser:***@localhost/deals
10 rows affected.

[('ADT Limited', 1, Decimal('5600.0000')),
 ('Advanta Corp.', 1, Decimal('1300.0000')),
 ('Alex. Brown Inc.', 1, Decimal('1700.0000')),
 ('Allied Colloids Group PLC', 1, Decimal('1810.0000')),
 ('American First Financial Insurance Group Inc.', 1, Decimal('2200.0000')),
 ('American Medical Response, Inc.', 1, Decimal('1120.0000')),
 ('American Radio Systems Corp.', 1, Decimal('2600.0000')),
 ('American Standard Companies, Inc.', 1, Decimal('4000.0000')),
 ('Amerisource Health Corp.', 1, Decimal('2322.0000')),
 ('Amphenol Corp.', 1, Decimal('1500.0000'))]

Here we used the `WHERE` clause to indicate that the `DealID` on the `Deals` table has to match the `DealID` on the `DealParts` table. Believe it or not, that basic logic (that keys on one table have t match keys on anther table) is exactly 92% of the power of the Relational Database Model. We can now just end the course now. How about the final exam next week?

More seriously, while using the `WHERE` clause to match records from different tables works, it s not very efficient. Instead we will want to use a `JOIN .. USING` operator, which is optimized to work with millions of records without breaking a sweat. In this case we don't even need a WHERE clause!

In [6]:
%%sql
SELECT DealName,PartNumber,DollarValue 
FROM Deals 
     JOIN DealParts USING (DealID)
LIMIT 10;

 * mysql+pymysql://dealsuser:***@localhost/deals
10 rows affected.

[('ADT Limited', 1, Decimal('5600.0000')),
 ('Advanta Corp.', 1, Decimal('1300.0000')),
 ('Alex. Brown Inc.', 1, Decimal('1700.0000')),
 ('Allied Colloids Group PLC', 1, Decimal('1810.0000')),
 ('American First Financial Insurance Group Inc.', 1, Decimal('2200.0000')),
 ('American Medical Response, Inc.', 1, Decimal('1120.0000')),
 ('American Radio Systems Corp.', 1, Decimal('2600.0000')),
 ('American Standard Companies, Inc.', 1, Decimal('4000.0000')),
 ('Amerisource Health Corp.', 1, Decimal('2322.0000')),
 ('Amphenol Corp.', 1, Decimal('1500.0000'))]

We can actually 'chain' table joins to link in data from as many tables as we want. We just have to specify what columns to use as keys! Each join in the chain creates a virtual table onto which we can join another table.

In [7]:
%%sql
SELECT DealName,LongCode as Role,CompanyName
FROM Companies
    JOIN Players USING (CompanyID)
    JOIN RoleCodes USING (RoleCode)
    JOIN Deals USING (DealID)
ORDER BY DealName
LIMIT 10;

 * mysql+pymysql://dealsuser:***@localhost/deals
10 rows affected.

[('ADT Limited', 'Target', 'ADT Limited'),
 ('ADT Limited', 'Second Bidder', 'Tyco International Ltd.'),
 ('ADT Limited', 'First Bidder', 'Western Resources, Inc.'),
 ('Advanta Corp.', 'Acquiror', 'Fleet Financial Group, Inc.'),
 ('Advanta Corp.', 'Target', 'Advanta Corp. Credit card unit'),
 ('Alex. Brown Inc.', 'Acquiror', 'Bankers Trust New York Corporation'),
 ('Alex. Brown Inc.', 'Target', 'Alex. Brown Inc.'),
 ('Allied Colloids Group PLC', 'First Bidder', 'Hercules Inc.'),
 ('Allied Colloids Group PLC', 'Target', 'Allied Colloids Group'),
 ('American First Financial Insurance Group Inc.', 'Acquiror', 'American International Group Inc.')]

Study the database schema below to see more opportunities to join tables. You will use this as a guide in the queries that follow.
 ![Deals ERD](img/img2_7.png)

## Challenge Queries: Now for the Fun Stuff
Three queries are described below. In the code cell provided after each description, write a SQL query that best answers the question. Each query should answer the question completely, without us humans needing to do any sorting, counting, etc. 

Don't forget to start each query cell with `%%sql`.

It's okay to collaborate with your classmates. Just be sure that you are typing out your own code.

### Query 1: Lots of joins
**For each deal, list every firm involved, what supporting role it played, and which company it supported.**  
You will need to output the following fields:
- `DealName` from the `Deals` table
- `Name` from the `Firms` table
- `LongCode` from the `SupportCodes` table
- `CompanyName` from the `Companies` table  

You will also need to use keys from the `Players` and `PlayerSupport` tables.

In [26]:
%%sql

/* Joining tables to Join them */

SELECT * FROM Deals 
    JOIN Players USING (DealID)
    JOIN Companies USING (CompanyID)
    JOIN PlayerSupports USING (PlayerID)
    JOIN Firms USING (FirmID)
    JOIN SupportCodes USING (SupportCodeID)
    LIMIT 5;

 * mysql+pymysql://dealsuser:***@localhost/deals
5 rows affected.

[(2, 225, 1, 24, 2, 'Alex. Brown Inc.', None, 'Baltimore', None, 'A', None, 'Bankers Trust New York Corporation', 1, 'BT Wolfensohn', None, 'I', 'IA', 'Investment Adviser', 4),
 (3, 73, 1, 24, 2, 'Alex. Brown Inc.', None, 'Baltimore', None, 'A', None, 'Bankers Trust New York Corporation', 2, 'Debevoise & Plimpton', None, 'c', 'AC', 'Counsel', 5),
 (14, 364, 1, 24, 2, 'Alex. Brown Inc.', None, 'Baltimore', None, 'A', None, 'Bankers Trust New York Corporation', 3, 'Kissel-Blake Inc.', None, 's', 'SOL', 'Proxy Solicitor', 19),
 (1, 116, 1, 24, 2, 'Alex. Brown Inc.', None, 'Baltimore', None, 'A', None, 'Bankers Trust New York Corporation', 4, 'Wachtell, Lipton, Rosen & Katz', None, 'c', 'OC', 'Outside Counsel', 2),
 (1, 124, 2, 140, 3, 'American Medical Response, Inc.', None, 'Aurora, CO', None, 'A', None, 'Laidlaw Inc.', 5, 'Katten Muchin & Zavis', None, 'c', 'OC', 'Outside Counsel', 2)]

### Query 2: Aggregation
**List the DealID, total dollar value and number of parts for each deal.**  
Don't forget to use your database schema map when planning out your joins. Also, be sure to include a comment (above the code) indicating what the view is intended to do.

In [64]:
%%sql

/* Aggregation of Tables to display DealID | Total Dollar Value | Number of Parts for Each Deal */

SELECT DealID, DealName, PartNumber, DollarValue FROM Deals
    JOIN DealParts USING (DealID)
    ORDER BY DealID
    LIMIT 5;

 * mysql+pymysql://dealsuser:***@localhost/deals
5 rows affected.

[(1, 'ADT Limited', 1, Decimal('5600.0000')),
 (2, 'Alex. Brown Inc.', 1, Decimal('1700.0000')),
 (3, 'American Medical Response, Inc.', 1, Decimal('1120.0000')),
 (4, 'American Standard Companies, Inc.', 1, Decimal('4000.0000')),
 (5, 'Amphenol Corp.', 1, Decimal('1500.0000'))]

### Query 3: Even More Aggregation
**List the DealID, DealName, number of players, total dollar value, and number of parts for each deal.**  
Bonus: use a subquery to construct a comma-separated list of deal types for each deal. (Don't forget the explanatory comment.)

In [85]:
%%sql

SELECT DISTINCT DealID, COUNT(PartNumber) AS NumParts, COUNT(PlayerID) AS TotalPlayers, SUM(DollarValue) AS TotalDollarValue FROM DealParts
    JOIN Deals USING (DealID)
    JOIN Players USING (DealID)
    GROUP BY PlayerID
    ORDER BY DealID
    Limit 5;

 * mysql+pymysql://dealsuser:***@localhost/deals
5 rows affected.

[(1, 1, 1, Decimal('5600.0000')),
 (2, 1, 1, Decimal('1700.0000')),
 (3, 1, 1, Decimal('1120.0000')),
 (4, 1, 1, Decimal('4000.0000')),
 (5, 1, 1, Decimal('1500.0000'))]

### Query 4: A Surprisingly Tricky One
**List TypeCode, number of deals, and total value of deals for each deal type.**  
Each firm should be listed, even if there are no deals for that firm.

In [115]:
%%sql

SELECT TypeCode, COUNT(DealID) AS NumberofDeals, SUM(DollarValue) FROM DealParts
    JOIN Deals USING (DealID)
    JOIN DealTypes USING (DealID)
GROUP BY TypeCode;

 * mysql+pymysql://dealsuser:***@localhost/deals
6 rows affected.

[('C/S', 80, Decimal('271794.0000')),
 ('CM', 3, Decimal('8030.0000')),
 ('PA', 1, Decimal('1880.0000')),
 ('PF', 4, Decimal('27790.0000')),
 ('SS', 59, Decimal('204658.0000')),
 ('TO', 16, Decimal('55972.0000'))]

### Query 5: Make up your own query to share.
Be creative. Impress us with your brilliance!

**List Type, Total Dollar Value, Total Deals** | 
**_Group by the Type_**

In [143]:
%%sql

SELECT DISTINCT Type, SUM(DollarValue) AS TotalValue, COUNT(DealID) FROM DealParts
    JOIN Deals USING (DealID)
    JOIN DealTypes USING (DealID)
    JOIN Players USING (DealID)
    JOIN PlayerSupports USING (PlayerID)
    JOIN Firms USING (FirmID)
GROUP BY Type
ORDER BY Type;

 * mysql+pymysql://dealsuser:***@localhost/deals
6 rows affected.

[(None, Decimal('190220.0000'), 36),
 ('c', Decimal('3981442.0000'), 813),
 ('I', Decimal('1744711.0000'), 413),
 ('l', Decimal('2814.0000'), 2),
 ('p', Decimal('715385.0000'), 122),
 ('s', Decimal('642251.0000'), 98)]